{"sections":{"main":{"type":"main-page","settings":{"padding_top":28,"padding_bottom":28}},"5870dfe7-6dd6-4424-87a1-75b3bedc0c7c":{"type":"collapsible-content","blocks":{"template--17964335792421__5870dfe7-6dd6-4424-87a1-75b3bedc0c7c-1677106007e4445014-0":{"type":"collapsible_row","settings":{"heading":"What methods do you use for shipping?","icon":"truck","row_content":"<p>We use FedEx. We have a 98% success rate with them. <\/p><p>Cakes and Pies will always go via FedEx Overnight (arriving by 8pm next business day)<\/p><p>All other items default to FedEx 2-day.<\/p><p> FedEx will NOT ship to a PO BOX address.<\/p><p><\/p>","page":""}},"template--17964335792421__5870dfe7-6dd6-4424-87a1-75b3bedc0c7c-1677106007e4445014-1":{"type":"collapsible_row","settings":{"heading":"When should I order my Ship-A-Cake?","icon":"check_mark","row_content":"<p>It's best to order your cake a week ahead of time.<\/p><p>Please select a DELIVERY DATE 1 day before you want to serve the cake. We recommend allowing our cake to thaw for 24 hrs in a refrigerator before serving.<\/p><p>We only ship on Mondays thru Thursdays and bake every cake to order. We ship cakes with Fedex Overnight and cakes arrive by 8pm the following day. No Saturday deliveries.<\/p>","page":""}},"template--17964335792421__5870dfe7-6dd6-4424-87a1-75b3bedc0c7c-1677106007e4445014-3":{"type":"collapsible_row","settings":{"heading":"Can I have an order delivered outside of the 50 United States?","icon":"check_mark","row_content":"<p>No, we can only ship within the 50 United States (no territories) at the moment. Aside from those, we're able to send overseas to US Military APO and FPO addresses, our boxes can only be delivered domestically within the US (as the risk of items getting stuck in international Customs is just too high)<\/p>","page":""}},"069c4998-d394-4a54-9fbf-e4b3f3022e9f":{"type":"collapsible_row","settings":{"heading":"When will my items ship?","icon":"check_mark","row_content":"<p>1 day (for cakes) and 2 days (Karma Boxes) before the delivery date you choose at checkout.  ... unless something unforeseen happens, in which case, we try our best. We will notify you if there is an issue.<\/p>","page":""}},"36004965-734a-4f78-9383-ca20b9110c65":{"type":"collapsible_row","settings":{"heading":"What if I put in the wrong address?","icon":"check_mark","row_content":"<p>It will go to the wrong place. And you’ll have to order and pay all over again and have a brand new shipment sent out. We hate when this happens. It’s super disappointing for everyone. Please DOUBLE CHECK your shipping address at checkout. Email us immediately at orders@karmabaker.com if you think there has been an error at checkout. Thanks!<\/p>","page":""}},"e5c23e31-3f6e-47b9-82f2-53c4b7ecd059":{"type":"collapsible_row","settings":{"heading":"How soon can i have something shipped?","icon":"check_mark","row_content":"<p>We bake everything to order. When you place your order you are given a choice of delivery dates to choose from, these dates are 3-5 days from now. After that your overnight or 2 day shipping options come into play.<\/p>","page":""}},"f8905468-1613-4d33-a8dd-2f5bb0865226":{"type":"collapsible_row","settings":{"heading":"Why are cakes shipped separately? Am I being charged twice for shipping?","icon":"truck","row_content":"<p>We ship cakes separately to ensure they arrive in as perfect condition as possible.  They are specially packaged and charged differently than other items.  We send each cake FedEx Overnight (roughly costing $175, but we have a special deal with FedEx, and are able to do a much lower fee per cake.)<\/p><p>Other items ship at a slower rate (2 days) for much less money. They are packaged to ship separately. That Overnight price is quite different from the cakes.<\/p><p>We do offer the ability for you to send items faster at your choice and expense, but at our pretty great rates.<\/p>","page":""}},"6e6f9f6e-4f72-42c7-9df8-c8526fa9ead0":{"type":"collapsible_row","settings":{"heading":"Why are you automatically charging me Route.com insurance?","icon":"check_mark","row_content":"<p>Because we love you!  And we want your shipping experience with us to be a positive one. The shipping services have become overloaded lately. They are delivering unprecedented amounts of packages each day and even more over the holidays.  Packages can get lost, have delays and just not show up at the address you specified. Your items may sit way too long because of this and Route.com Insurance will take care of sending you a new order or getting a refund to you. You pay a tiny amount to be 100% covered.<\/p><p>Please note that if you OPT-OUT of the Route.com Shipping Protection Insurance, Karma Baker will NOT REFUND you for any lost, stolen, late or damaged shipments. This would now be your responsibility. <\/p><p>Don't uncheck that box ;)<\/p>","page":""}}},"block_order":["template--17964335792421__5870dfe7-6dd6-4424-87a1-75b3bedc0c7c-1677106007e4445014-0","template--17964335792421__5870dfe7-6dd6-4424-87a1-75b3bedc0c7c-1677106007e4445014-1","template--17964335792421__5870dfe7-6dd6-4424-87a1-75b3bedc0c7c-1677106007e4445014-3","069c4998-d394-4a54-9fbf-e4b3f3022e9f","36004965-734a-4f78-9383-ca20b9110c65","e5c23e31-3f6e-47b9-82f2-53c4b7ecd059","f8905468-1613-4d33-a8dd-2f5bb0865226","6e6f9f6e-4f72-42c7-9df8-c8526fa9ead0"],"settings":{"caption":"","heading":"Shipping FAQ","heading_size":"h1","heading_alignment":"center","layout":"none","color_scheme":"background-2","container_color_scheme":"accent-1","open_first_collapsible_row":false,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}},"f2925503-daaa-4165-aefe-edc9ebba2419":{"type":"collapsible-content","blocks":{"1911764d-707b-4213-99c7-6c992b98b0fb":{"type":"collapsible_row","settings":{"heading":"Are all Karma Baker products vegan & plant-based?","icon":"plant","row_content":"<p>Yes. We are 100% dairy, egg and animal product free. We use only organic vegan unrefined sugar.<\/p>","page":""}},"2e6168ef-2ff6-4aca-8b6f-1cc261bda679":{"type":"collapsible_row","settings":{"heading":"Are all Karma Baker products gluten-free?","icon":"gluten_free","row_content":"<p>Yes. We are a dedicated gluten-free facility which means we do not process any wheat, barley, rye or malt. None of our ingredients contain any gluten. Our specially formulated Organic Karma Baker flour is third party tested to be under 15 ppm.<\/p>","page":""}},"777320bb-b12b-4221-b88b-8a2dc5f0b640":{"type":"collapsible_row","settings":{"heading":"Is Karma Baker organic & non-GMO?","icon":"plant","row_content":"<p>As parents and caring members of our community, we source organic ingredients wherever possible and all of our ingredients are non-GMO.<\/p>","page":""}},"f88937e2-7c4a-4985-9015-cf798a8dd975":{"type":"collapsible_row","settings":{"heading":"How do I store my items and what is the shelf life?","icon":"box","row_content":"<p>Remember that fridges dry food out day by day and freezers halt freshness in its tracks!<\/p><p>Our items don't go bad or get moldy because they don't have dairy or eggs. They get dry like traditional items if they sit around too long. Our items are \"best by\" when you get them! They taste the best at room temperature, except for cold-style items like cream cakes and tarts.<\/p><p>Cookies, donuts, brownies and cupcakes (jars) are best before 2 weeks and can be stored in the freezer for up to 4 months.<\/p><p>In-bakery items like cream tarts and desserts which all require refrigeration, (so they don't get melty and gross) stay fresh in the fridge for 7-10 days and up to 4 months in the freezer.<\/p><p>Cakes are best stored in the fridge for only a couple of days and up to 1 month in the freezer (cakes should be removed from the fridge 4 hours before serving). We always recommend freezing if you aren't going to eat it right away.<\/p><p>At home Arek and I (Celine, here) like to keep stuff frozen and not let the fridge have a chance to dry it out. We then pull it out a bit before we eat it. We've kept desserts frozen for longer than a year and it was still (surprisingly) pretty fabulous. We don't recommend this - just thought it was fun trivia!<\/p>","page":""}},"c475eea8-b49a-4e56-a911-7b5cd040e7f4":{"type":"collapsible_row","settings":{"heading":"Why do you say you're not allergy-friendly?","icon":"nut_free","row_content":"<p>While we don't use some ingredients that are considered allergens, like dairy, eggs and wheat, we do use nuts and soy as well as other allergens. We bake too many items a day, standing way too close to each other to be able to contain all allergens. We know we cannot guarantee there won't be batter splatter or that the oven won't get a nut stuck in the convection fan on a batch of walnut brownies and spit it back out while we bake vanilla cakes.<\/p><p>Please don't take chances with your allergies or ask us to.<\/p>","page":""}},"1cb68cbb-9ff7-4ca7-956d-30ee4871bfdd":{"type":"collapsible_row","settings":{"heading":"Do you process nuts and peanuts?","icon":"nut_free","row_content":"<p>Yes, we sure do!<\/p><p>If you are severely allergic, we do not recommend eating our products.<\/p>","page":""}},"a7f20581-917c-47e9-a7af-25e24d05a770":{"type":"collapsible_row","settings":{"heading":"Do you make Keto or Paleo items?","icon":"fire","row_content":"<p>No, we do not.<\/p>","page":""}},"77b0ce54-485a-4f65-b84b-5e10167c326d":{"type":"collapsible_row","settings":{"heading":"What kind of sugar does Karma Baker use?","icon":"leaf","row_content":"<p>We use organic vegan sugar which is an unprocessed evaporated cane juice. It has the same grams of sugar as regular sugar but is not processed with bone char or chemicals and so, is vegan.<\/p>","page":""}},"b26bec1e-a81e-4292-bab9-dc9a442badcc":{"type":"collapsible_row","settings":{"heading":"Does Karma Baker deliver locally?","icon":"truck","row_content":"<p>Yes, we deliver to a limited range within and around Ventura and Los Angeles counties; please call the bakery to schedule a delivery. <\/p>","page":""}},"4a7ff06b-2225-43bc-aab3-1e72e2cc1b27":{"type":"collapsible_row","settings":{"heading":"Does Karma Baker make wedding cakes?","icon":"heart","row_content":"<p>Yes, we have provided many beautiful brides with delicious and beautiful cakes over the years. Please visit our Cake Gallery and our Instagram page to see some photos.  To taste our cake flavors, simply come in and purchase the cupcakes or pre-order a tasting kit. If your wedding cake is over $150, we will deduct the tasting costs (up to $35) from your wedding cake total.<\/p><p>Please call the bakery at 747-222-7379 to pre-order specialty flavors.  And if you have a cake style in mind, please email a photo or 2 of the cake you'd like, to  karmabakercakes@gmail.com and we will help design and order your cake. Please include your call back number.<\/p>","page":""}},"2a5809ce-01ff-4554-8342-0f728edbabba":{"type":"collapsible_row","settings":{"heading":"Is Karma Baker kosher?","icon":"serving_dish","row_content":"<p>Yes, we are certified kosher under Rabbi Markel's KCA Orthodox kosher certification.  You can view our certificate <a href=\"\/pages\/kosher-certificate\" target=\"_blank\" title=\"Kosher Certificate\">here.<\/a><\/p>","page":""}}},"block_order":["1911764d-707b-4213-99c7-6c992b98b0fb","2e6168ef-2ff6-4aca-8b6f-1cc261bda679","777320bb-b12b-4221-b88b-8a2dc5f0b640","f88937e2-7c4a-4985-9015-cf798a8dd975","c475eea8-b49a-4e56-a911-7b5cd040e7f4","1cb68cbb-9ff7-4ca7-956d-30ee4871bfdd","a7f20581-917c-47e9-a7af-25e24d05a770","77b0ce54-485a-4f65-b84b-5e10167c326d","b26bec1e-a81e-4292-bab9-dc9a442badcc","4a7ff06b-2225-43bc-aab3-1e72e2cc1b27","2a5809ce-01ff-4554-8342-0f728edbabba"],"settings":{"caption":"","heading":"Bakery and About Us FAQ","heading_size":"h1","heading_alignment":"center","layout":"none","color_scheme":"background-2","container_color_scheme":"background-2","open_first_collapsible_row":true,"image_ratio":"adapt","desktop_layout":"image_second","padding_top":36,"padding_bottom":36}}},"order":["main","5870dfe7-6dd6-4424-87a1-75b3bedc0c7c","f2925503-daaa-4165-aefe-edc9ebba2419"]}