{"sections":{"main":{"type":"main-page","settings":{"padding_top":8,"padding_bottom":12}},"f381a3c0-801e-41ce-adae-4f501934640d":{"type":"image-with-text","blocks":{"template--17964652658981__f381a3c0-801e-41ce-adae-4f501934640d-1677108747b8460e1d-0":{"type":"heading","settings":{"heading":"Eat. Good. Karma.","heading_size":"h0"}},"template--17964652658981__f381a3c0-801e-41ce-adae-4f501934640d-1677108747b8460e1d-1":{"type":"text","settings":{"text":"<p>Always Vegan & Gluten-Free (No wheat, eggs, or dairy). We say that upfront because no one believes our stuff is BOTH vegan and gluten free and looks and tastes this good. Well it does and it is. Experience what we call<em> Enlightened Baking<\/em>. A culmination of consciousness and a loving environment, where we bake, create, get along and actually like each other. Resulting in food that is extraordinary. We are saving our planet and your soul’s karma. You can thank us next time round<\/p><p>But really, we use the best organic vegan and gluten free ingredients we can get and make great food.<\/p><p>Enlightened Baking means we don’t do things the same old way. We are awakened to what it means to treat each other and ourselves with dignity and loving-kindness at every turn.<\/p><p>We love baking.<\/p><p>We believe in being amazing.<\/p><p>We believe we can change the collective consciousness with every day we show up to work.<\/p><p>We will overachieve to be there for the conscious person that wants a damn good cookie to eat.<\/p><p>We are Karma Baker.<\/p>","text_style":"body"}}},"block_order":["template--17964652658981__f381a3c0-801e-41ce-adae-4f501934640d-1677108747b8460e1d-0","template--17964652658981__f381a3c0-801e-41ce-adae-4f501934640d-1677108747b8460e1d-1"],"settings":{"image":"shopify:\/\/shop_images\/store_fortn_with_peopleLOREZ.jpg","height":"large","desktop_image_width":"medium","layout":"image_first","desktop_content_position":"top","desktop_content_alignment":"left","content_layout":"overlap","color_scheme":"background-1","mobile_content_alignment":"left","padding_top":36,"padding_bottom":36}},"d89b92c6-8b8a-4a6d-b668-a80066f31113":{"type":"image-with-text","blocks":{"template--17964652658981__d89b92c6-8b8a-4a6d-b668-a80066f31113-1677108747b8460e1d-0":{"type":"heading","settings":{"heading":"HOW WE CAME TO BE","heading_size":"h2"}},"template--17964652658981__d89b92c6-8b8a-4a6d-b668-a80066f31113-1677108747b8460e1d-1":{"type":"text","settings":{"text":"<p><\/p><p>In 2005, Celine began her journey into the world of plant-based baking (no eggs, wheat\/gluten, butter or cream) when her neighbor’s daughter, Sofia, was unable to eat desserts due to her severe dietary restrictions.  This felt unacceptable to Celine so she became determined to make something edible and sweet that this little girl could enjoy along with everyone else. The end result was a delicious brownie that became a huge hit.  In fact, Celine continued to bake for Sofia and her family and eventually discovered her own list of mild allergies to gluten, wheat, dairy, and eggs.<\/p><p>It was during this time Celine shifted, becoming acutely aware of her own karmic footprint (when a person consumes animal products, their karma is affected) and as a result, chose an animal-free diet. Being plant-based, inspires and moves Celine to show the world there is another way to partake in life’s pleasures of good food and delectable desserts. Karma Baker is meant to be enjoyed and she’s letting everyone know – one gluten-free\/vegan cupcake at a time.<\/p>","text_style":"body"}}},"block_order":["template--17964652658981__d89b92c6-8b8a-4a6d-b668-a80066f31113-1677108747b8460e1d-0","template--17964652658981__d89b92c6-8b8a-4a6d-b668-a80066f31113-1677108747b8460e1d-1"],"settings":{"image":"shopify:\/\/shop_images\/KarmaBaker-Headshots-56_ce20eaa1-d672-41c7-bb1a-b162073f553c.jpg","height":"small","desktop_image_width":"small","layout":"text_first","desktop_content_position":"top","desktop_content_alignment":"right","content_layout":"overlap","color_scheme":"background-1","mobile_content_alignment":"left","padding_top":36,"padding_bottom":36}},"0713df58-bbb2-4c16-9df3-a8a062494ada":{"type":"multicolumn","blocks":{"template--17964652658981__0713df58-bbb2-4c16-9df3-a8a062494ada-1677110798cb919ce5-0":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/IMG_9904.jpg","title":"","text":"<p><strong>CELINE IKELER <\/strong><em>is <\/em>the Karma Baker. She created the bakery because she can’t stand to see someone eat bad food. And definitely not bad desserts.  She’s a firm believer in making calories count, workouts that leave one dripping in sweat and meditating to balance it all out.  Her favorite saying is <em>“Meditate twice a day, and if you don’t have time, do an hour.”<\/em><\/p><p>She fell in love with Arek at a glance over a pumpkin crumb cake. Read that revealing story <a href=\"https:\/\/karmabaker.com\/blog\/pumpkin-crumb-cake-love-story\/\">here<\/a>.  In her spare time, you will actually find her in the kitchen test baking new recipe ideas that have been tormenting her until she has free play time.  Buy her first cookbook <a href=\"https:\/\/www.amazon.com\/gp\/product\/B08L5L3FF9\/ref=dbs_a_def_rwt_bibl_vppi_i0\">here.<\/a> She has way too many animals and kids.<\/p>","link_label":"","link":""}},"template--17964652658981__0713df58-bbb2-4c16-9df3-a8a062494ada-1677110798cb919ce5-1":{"type":"column","settings":{"image":"shopify:\/\/shop_images\/karmabaker-headshots-53.jpg","title":"","text":"<p><strong>AREK REEDER <\/strong><em>– Chief of Operations<\/em><\/p><p><strong> <\/strong>Celine rescued Arek in the early days of the bakery when we were still baking at home. He’s the work horse of the business and has never shied away from a job that needs doing.  He does it all, however, we still have “teach Arek how to bake” written on our white board’s to-do list. He is the voice behind every sweetly written customer service email that leaves here. And yes, he’s really that nice. Just ask the mailman, the grocer or the gardeners.   Arek started out as a child actor, you may recognize him from a McDonald’s commercial here and there. However, even back then he was a devout vegetarian, and was never allowed to eat at Mikky D’s. Good for his parents! Today he is still carrying the torch, saving animals and the environment one cupcake at a time.   He also has too many animals and kids.<\/p>","link_label":"","link":""}},"template--17964652658981__0713df58-bbb2-4c16-9df3-a8a062494ada-1677110798cb919ce5-2":{"type":"column","settings":{"title":"","text":"<p><strong>MAGGY PARADISO <\/strong><em>– Head of Kitchen <\/em><\/p><p><strong> <\/strong>Maggy joined the Karma team when we needed her most. She is the mother of the kitchen and the heart and soul of that cupcake you’re eating. She rules the roost with a loving fist.  When Celine comes up with some crazy new recipe, it’s Maggy that turns that batch of 12 cookies into a batch of 300 and each one tastes as good as the next. She has super-sonic hearing and eyes in the back of her head. And yes, she heard that!  She likes Karma Baker so much that she makes her husband and kids work there too.<\/p>","link_label":"","link":""}},"f932f862-4f74-4d5c-a9e7-b13fdfb0ed83":{"type":"column","settings":{"title":"","text":"<p><strong>BETY VIRAMONTES<\/strong> <em>– Head of Front of House<\/em><\/p><p>When Bety came to us she was twice the woman she is now – like really, she lost 160 lbs this past year!  How’s that for a transformational experience in the karma capitol of LA?  It happens around here. A lot.  Bety has more bakery experience than any of us and thank God or we’d never know half the things we do now! She came with all of the trade secrets from every famous bakery she’s worked for… and there are many (insert maniacal laughter here) If the lights are on in the bakery at 3am, it’s Bety.<\/p>","link_label":"","link":""}},"cfd7f3b1-eb33-4dcd-80aa-8a1499aead83":{"type":"column","settings":{"title":"","text":"<p><strong>KRISTY B<\/strong> <em>– Ecommerce Goddess<\/em><\/p><p><em> <\/em>With her trusty tape gun strapped to her hip you will find Kristy tirelessly packing your cakes and tasty morsels for its extraordinary journey across town or country.  Packed with love and dry ice and exactly what you ordered.  When you write the wrong address on your order and frantically write an email to us with the CORRECT address, she’s the one who takes care of you. She’s meticulous and no nonsense when it comes to the details. We heart her for that!  Oh! And don’t touch her tape gun!<\/p>","link_label":"","link":""}}},"block_order":["template--17964652658981__0713df58-bbb2-4c16-9df3-a8a062494ada-1677110798cb919ce5-0","template--17964652658981__0713df58-bbb2-4c16-9df3-a8a062494ada-1677110798cb919ce5-1","template--17964652658981__0713df58-bbb2-4c16-9df3-a8a062494ada-1677110798cb919ce5-2","f932f862-4f74-4d5c-a9e7-b13fdfb0ed83","cfd7f3b1-eb33-4dcd-80aa-8a1499aead83"],"settings":{"title":"Meet Our Team","heading_size":"h1","image_width":"third","image_ratio":"square","columns_desktop":3,"column_alignment":"left","background_style":"primary","button_label":"Home","button_link":"shopify:\/\/collections","color_scheme":"background-1","columns_mobile":"1","swipe_on_mobile":false,"padding_top":36,"padding_bottom":36}}},"order":["main","f381a3c0-801e-41ce-adae-4f501934640d","d89b92c6-8b8a-4a6d-b668-a80066f31113","0713df58-bbb2-4c16-9df3-a8a062494ada"]}